// 문제 2-12
/* 키를 정숫값으로 읽어 들여 표준체중을 실수로 출력하는 프로그램을 작성하자.
   표준체중은 (키-100)*0.9를 이용해 구한 다음 소수점 이하 한 자리만 출력한다. */

#include <stdio.h>

int main(void) {
	int height;

	printf("키를 입력하세요 : ");
	scanf("%d", &height);

	printf("표준체중은 %.1f입니다.\n", (height-100)*0.9);

	return 0;
}

// 형식 지정자
// %.1f: '부동소수점수를 소수점 이하 1자리로 출력하라'는 지시
/* ex) %09.9f -> 0: 0 플래그
                 왼쪽 9: 최소 필드 폭
				 오른쪽 9: 정밀도
				 f: 형식 지정자 */
/* 0 플래그: 0을 지정하면 숫자 앞에 여백이 있을 때 0으로 채워 표시한다.
           이 플래그를 생략하면 공백으로 채운다. */
/* 최소 필드 폭: *최소한의 표시 문자 수를 지정한다.
             *적어도 이 자릿수로 표시를 수행한다.
             *이 지정을 생략하거나 실제로 표시할 숫자가 지정된 값을 넘을 때는
             그 숫자를 표시하는 데 필요한 자릿수로 표시한다.
             *-를 지정했을 때는 왼쪽으로 정렬해서 표시하며 지정이 없을 때는 오른쪽으로 지정한다. */
/* 정밀도: 표시할 최소 자릿수를 지정한다.
        생략하면 정수의 정밀도는 1로 간주하며 부동소수점수의 정밀도는 6으로 간주한다. */
/* 형식 지정자: d - int형 정수를 10진수로 표시한다.
            f - double형 부동소수점수를 10진수로 표시한다. */
