// 문제 4-11
// 정숫값을 읽어 들여 그 값의 개수만큼 +와 -를 교대로 출력하는 프로그램을 작성하자.

#include <stdio.h>

int main(void) {
	int i, no;
	
	printf("양의 정수: ");
	scanf("%d", &no);
	
	if (no >= 1) {
		int i = 1;
		while (i <= no){
			if (i % 2)
				putchar('+');
			else
				putchar('-');
			i++;
		}
		putchar('\n');
	}
	
	return 0;
}

/* 프로그램 A
   변수 i의 값을 1, 2, 3, ...으로 인크리먼트하는 과정에서 i가 홀수(i를 2로 나눈 나머지가 1)면
   '+'를 출력하고 짝수면 '-'를 출력함으로써 +와 -를 교대로 출력할 수 있다. */

/* 이 프로그램에는 크게 두 가지 단점이 있다.
   1. 반복할 때마다 if문의 판정을 수행한다는 점
   while문을 이용하여 반복을 수행할 때마다 if문을 실행한다. 그러므로 i를 no번 수행해 홀수인지 짝수인지 판정한다.
   2. 사양 변경에 대한 유연성이 없다는 점
   while문 반복을 제어하는 변수 i의 시작 값을 1에서 0으로 변경해보자.
	int i = 0;
	while (i<no) {
		if (i % 2 == 0)
			putchar('+');
		else
			putchar('-');
		i++;
	} */
/* 프로그램 A의 while문을 다음과 같이 구현하면 프로그램이 간결해진다. 그러나 두 가지 단점은 그대로다.
	while (i<=no)
		putchar(i++ % 2 ? '+' : '-'); */
