// 문제 4-12
// 양의 정숫값을 읽어 들여 이를 역순으로 출력하는 프로그램을 작성하자.

#include <stdio.h>

int main(void) {
	int no;

	do{
		printf("양의 정수를 입력하세요: ");
		scanf("%d", &no);
		if (no <= 0)
			puts("\a양의 정수만 입력해주세요.");
	} while (no <= 0);

	printf("%d을(를) 거꾸로 읽으면 ", no);
	while (no > 0) {
		printf("%d", no % 10);
		no /= 10;
	}
	puts("입니다.");

	return 0;
}

// 숫자의 역순 표시
// 처음 do문은 읽어 들인 값을 양수로 제한하는 반복문이다.
// 반복이 끝나면 no의 값은 반드시 양수, 즉 0보다 큰 수가 된다.
// while문에서는 읽어 들인 정숫값을 역순으로 출력한다.
// 식 no /= 10은 변수 no의 최하위 자리를 추출하고 그 외의 자리를 오른쪽으로 한 자리 밀게 된다.
