// 문제 4-14
// 1부터 n까지의 합을 구하는 프로그램을 작성하자. n값은 키보드로 입력한다.

#include <stdio.h>

int main(void) {
	int i;
	int sum = 0;
	int n;

	printf("n의 값: ");
	scanf("%d", &n);

	for (i=1; i<=n; i++)
		sum += i;

	printf("1부터 %d까지의 합은 %d입니다.\n", n, sum);

	return 0;
}

/* for문
   for 뒤의 ()는 ;로 구분된 3개 부분(A부, B부, C부)으로 구성된다.
   for문은 프로그램의 흐름을 다음 [그림]과 같이 제어한다.
   1. '전처리'로서 A부를 평가하고 실행한다.
   2. '계속 조건'인 B부의 제어식이 0이 아니면 구문(루프 본체)을 실행한다.
   3. 구문 실행 후 '다음 반복을 위한 준비'인 C부를 평가하고 실행한 다음 2로 돌아간다. */

// 식별자(identifier): 변수나 함수 등에 붙인 이름이다.
