// 문제 4-15(프로그램 B)
// 1234567890을 반복 출력하는 프로그램을 작성하자. 읽어 들인 정숫값의 개수만큼 숫자를 출력한다.
// (예를 들어 25를 입력했다면 1234567890123456789012345라고 출력한다).

#include <stdio.h>

int main(void) {
	int i, no, r, q;

	printf("양의 정수를 입력해주세요 : ");
	scanf("%d", &no);

	q = no/10;
	r = no%10;

	for (i=1; i<=q; i++)
		printf("1234567890");
	for (i=1; i<=r; i++)
		printf("%d", i%10);
	putchar('\n');

	return 0;
}

// 프로그램 B에서는 나눗셈 횟수와 반복 횟수 모두 줄어든다.
// 예를 들어 no가 87이면 다음과 같이 된다.
// 프로그램 A   반복 횟수 : 87           나눗셈 횟수 : 87
// 프로그램 B   반복 횟수 : 8 + 7 = 15   나눗셈 횟수 : 2 + 7 = 9

// 구분자(punctuator): 키워드나 식별자는 일종의 '단어'이며, 그 단어를 구분하는 데 사용하는 기호
// ex) [ ] ( ) { } * , : = ; ... #
