// 문제 4-18
// 1부터 n까지 정숫값의 제곱 값을 표시하는 프로그램을 작성하자. n값은 키보드로 입력한다.

#include <stdio.h>

int main(void) {
	int i, n;

	printf("n의 값 : ");
	scanf("%d", &n);

	for (i=1; i<=n; i++)
		printf("%d의 제곱은 %d\n", i, i*i);

	return 0;
}

/* 반복문(iteration statement): 이 장에서 배운 do문, while문, for문과 같이
                              프로그램의 흐름을 반복하는 구문 */

// 문자 상수, 숫자 상수, 부동소수점 상수, 문자열 리터널은 프로그램을 구성하는 요소 중 하나다.

/* 공백 문자나 주석을 사이에 둔 인접 문자열 리터널은 하나로 취급된다.
   예를 들어 "ABC" "DEF"는 "ABCDEF"가 된다.
   이를 이용하면 긴 문자열 리터럴을 읽기 쉽게 입력할 수 있다.
   다음에 그 일례를 나타낸다.
puts("옛날 어느 곳에 할아버지와 할머니가 살고 있었습니다. "
		"할아버지는 할머니를 무척 사랑했습니다."); */
