// 문제 4-19(프로그램 B)
// 정숫값을 읽어 들여 그 개수만큼 '*'를 출력하는 프로그램을 작성하자. 5개마다 줄 바꿈을 출력한다.

#include <stdio.h>

int main(void) {
	int no;

	printf("몇 개의 *를 출력할까요? ");
	scanf("%d", &no);

	if (no > 0) {
		int i;
		int rem = no % 5;
		for (i=0; i<no/5; i++)      // 1
			puts("*****");          // 1
		if (rem>0) {                // 2
			for (i=0; i<rem; i++)   // 2
				putchar('*');       // 2
			putchar('\n');          // 2
		}
	}

	return 0;
}

/* 프로그램 B
   프로그램 A의 단점을 보완한 프로그램이며 두 부분으로 구성된다.
   1. no/5개의 "*****"를 줄 바꿈 하면서 출력
      for문은 "*****" 출력을 no/5번 반복한다.
      출력 횟수는 no가 15면 3번, no가 14면 2번이다.
      puts 함수를 사용하므로 출력할 때마다 줄 바꿈 한다.
   2. no%5개의 '*'와 줄 바꿈 출력
      no가 5의 배수가 아니면 남은 마지막 행을 출력한다.
      no를 5로 나눈 나머지 개수(예를 들어 no가 14라면 4개)만큼 *를 출력하고 줄 바꿈 문자를 출력한다.
   no가 5의 배수면 변수 rem의 값은 0이 되므로 기호 문자와 줄 바꿈 문자 모두 출력하지 않는다. */
