// 문제 4-19(프로그램 A)
// 정숫값을 읽어 들여 그 개수만큼 '*'를 출력하는 프로그램을 작성하자. 5개마다 줄 바꿈을 출력한다.

#include <stdio.h>

int main(void) {
	int no;

	printf("몇 개의 *를 출력할까요? ");
	scanf("%d", &no);

	if (no > 0) {
		int i;
		for (i=0; i<no; i++) {
			putchar('*');
			if (i%5 == 4)
				putchar('\n'); // 1
		}
		if (i%5 != 0)
			putchar('\n'); // 2
	}

	return 0;
}

/* 프로그램 A
   변수 i값을 0, 1, 2, ...로 인크리먼트하면서 기호 문자 '*'를 출력한다.
   줄 바꿈을 수행하는 것은 1, 2 두 군데다.
   1. 기호 문자를 출력할 때 변수 i값을 5로 나눈 나머지가 4라면 줄 바꿈 한다.
       줄 바꿈 문자를 출력하는 조건은 i값이 4, 9, 14, ...일 때다.
   2. no가 5의 배수면 마지막에 출력한 * 뒤의 줄 바꿈이 마지막이다.
      no가 5의 배수가 아니면 마지막 줄 바꿈은 아직 수행되지 않는다.
      그러므로 no가 5의 배수가 아닐 때만 마지막 줄 바꿈을 수행한다.
   프로그램 A는 for문을 이용해서 반복을 수행할 때마다 if문으로 판정을 수행하므로
   그리 효율적이지 못하다는 단점을 갖고 있다. */
