// 문제 4-20
// 읽어 들인 정숫값의 모든 약수를 출력하는 프로그램을 작성하자. 약수 출력이 끝난 후 약수 개수도 함께 출력한다.

#include <stdio.h>

int main(void) {
	int i, n, count;

	printf("정숫값 : ");
	scanf("%d", &n);

	count = 0;                           // 1
	for (i=1; i<=n; i++)                 // 2
		if(n%i == 0){                    // 2
			printf("%d\n", i);           // 2
			count++;                     // 2
		}
	printf("약수는 %d개입니다.\n", count);    // 3

	return 0;
}

/* 약수 나열
   읽어 들인 정숫값 n의 모든 약수와 그 개수를 출력하는 프로그램이다.
   1. 약수의 개수를 저장할 변수 count를 0으로 한다.
   2. 이 for문에서는 변수 i의 값을 1부터 n까지 인크리먼트한다.
      n이 12면 i는 1부터 12까지 늘어난다.
      n을 i로 나눈 나머지가 0이면(n이 i로 나눠떨어지면)i는 n의 약수이므로 그 값을 출력하고 count를 인크리먼트한다.
   3. 약수의 개수인 count 값을 출력한다. */
