// 문제 4-23
// 읽어 들인 정수가 한 변의 길이인 정사각형을 출력하는 프로그램을 작성하자. * 문자를 나열하여 출력한다.

#include <stdio.h>

int main(void) {
	int i, j;
	int height;

	puts("정사각형을 그립니다. ");
	printf("높이는 얼마입니까? "); scanf("%d", &height);

	for (i=1; i<=height; i++){
		for (j=1; j<=height; j++)
			putchar('*');
		putchar('\n');
	}

	return 0;
}

// [문제 4-23]은 for문을 이용한 다중 루프를 사용하여 넓이와 높이가 같은 정사각형을 '*'로 출력한다.
// 단, 넓이와 높이가 같으므로 다중 루프에서 사용하는 변수는 height 하나면 충분하다.
// 덧붙여 for문을 사용할 때는 식이 1부터 시작하는지 0부터 시작하는지에 따라 비교 연산자 사용이 달라진다는 점에 주의하자.
