// 문제 4-28
/* 읽어 들인 정수 개의 단으로 이루어진 피라미드를 출력하는 프로그램을 작성하자.
   제 i행째에는 (i-1)*2+1개의 '*'기호를 출력한다. */

#include <stdio.h>

int main(void) {
	int i, j;
	int h;

	puts("피라미드를 만듭니다.");
	printf("몇 단인가요? ");
	scanf("%d", &h);

	for (i=1; i<=h; i++) {
		for (j=1; j<=h; j++)
			putchar(' ');
		for (j=1; j<=2*i-1; j++)
			putchar('*');
		putchar('\n');
	}

	return 0;
}

/* 위로 향한 피라미드 출력
   피라미드(엄밀히 말하면 이등변삼각형)을 출력하는 문제다.
   i행째에는 h-1개의 공백 문자와 2*i-1개의 기호 문자 *를 출력한다. */

/* 아래로 향한 피라미드 출력
   여기서부터는 [문제 4-29]에 대한 설명이다.
   기호 문자가 아닌 숫자 문자를 표시하게 되어 있다.
   제 i행째에 i%10을 출력하므로 각 행이 몇 번째 행인지 한눈에 알 수 있다.
   i-1개의 공백 문자와 2*(h-i)+1개의 숫자다. */
