// 문제 4-29
/* 읽어 들인 정수 개의 단으로 이루어지며 아래로 향하는 숫자 피라미드를 출력하자.
   제 i행째에는 i%10으로 얻은 숫자를 표시한다. */

#include <stdio.h>

int main(void) {
	int i, j;
	int h;

	puts("아래로 향한 숫자 피라미드를 만듭니다.");
	printf("몇 단인가요? ");
	scanf("%d", &h);

	for (i=1; i<=h; i++) {
		for (j=1; j<=i; j++)
			putchar(' ');
		for (j=1; i<2*(h-i)+1; i++)
			printf("%d", i%10);
		putchar('\n');
	}

	return 0;
}

/* C언어에서는 원칙적으로 자유로운 위치에 프로그램을 작성할 수 있다.
   일부 프로그래밍 언어처럼 프로그램의 각 행을 특정 자리 위치부터 작성해야 하거나 하나의 구문을 하나의 행에
   모두 써야 하는 등과 같은 제한이 없다.
   자유 형식(free formatted)이 허락되지만, 다음과 같은 제한은 있다.
   [1] 단어 가운데 공백 문자를 넣어서는 안됨
       int나 return 등의 키워드, n1이나 n2등의 식별자, +=나 ++ 등의 연산자는 하나의 '단어'다.
       그러므로 이들 가운데에 공백류 문자(공백 문자, 탭, 줄 바꿈 등)을 넣어서는 안 된다.
   [2] 전처리 지시 안에서 줄 바꿈 해서는 안 됨
       자유 형식인 C언어도 #include 등과 같이 #으로 시작하는 전처리 지시는 특별하게 다룬다.
       이들은 원칙적으로 모두 한 줄로 작성해야 한다.
   [3] 문자열 리터럴 가운데나 문자 상수 가운데에서 줄 바꿈 해서는 안 됨
       큰따옴표로 문자열을 감싼 문자열 리터럴 "..."나 작은따옴표로 문자를 감싼 문자 상수 '...'도 일종의 단어다.
       따라서 가운데에 줄 바꿈 문자 등을 넣어서는 안 된다. */
