// 문제 4-3
// 정숫값을 읽어 들여 0까지 카운트다운하는 프로그램을 작성하자.

#include <stdio.h>

int main(void) {
	int no;

	printf("양의 정수를 입력하세요 : ");
	scanf("%d", &no);

	if (no >= 0) {
		while (no >= 0) {
			printf("%d ", no);
			no--;
		}
		printf("\n");
	}
	return 0;
}

// 이 프로그램에서 카운트다운을 구현하는 데 이용한 구문이 while문(while statement)이다.
// 마지막으로 화면에 출력되는 no값은 0이지만, while문 종료 시 그 값은 -1이 된다는 데 주의
/* do문과 while문
   예를 들어 no에 읽어 들인 값이 -5라면 while문의 제어식 no >= 0의 평가 결과가 0이 되므로 루프 본체는 한 번도 실행되지 않는다.
   do문의 루프 본체가 적어도 한 번은 실행회는 데 비해 while문의 루프 본체는 한 번도 실행되지 않을 가능성이 있다.
   do문   : 후 판정 반복: 루프 본체를 실행한 다음 판정 수행
   while문: 전 판정 반복: 루프 본체를 실행하기 전에 판정 수행
   cf) for문은 전 판정 반복이다. */
