// 문제 4-4
// 정숫값을 읽어 들인 다음 1까지 카운트다운하는 프로그램을 작성하자.

#include <stdio.h>

int main(void) {
	int no;

	printf("양의 정수를 입력하세요: ");
	scanf("%d", &no);

	if (no >= 1) {
		while (no >= 1)
			printf("%d ", no--);
		printf("\n");
	}

	return 0;
}

/* no--를 출력할 때는 두 단계의 순서를 거치게 된다.
   1. no값 표시 2. no값 디크리먼트
   한마디로 'no값을 출력한 직후 디크리먼트한다.'라는 의미다. */

/* 전치 증가 연산자(prefixed increment operator)와 전치 감소 연산자(prefixed decrement operator)
   인크리먼트나 디크리먼트를 수행한다는 점에서 후치 증가 연산자나 후치 감소 연산자와 마찬가지지만 인크리먼트 시점이 다르다.
   ++a나 --a라는 식을 평가해서 얻을 수 있는 것은 인크리먼트나 디크리먼트 다음 값이다.
   전치 증가 연산자   ++a   a의 값을 하나만 증가시킴(식 전체를 평가하면 증가 후의 값이 됨)
   전치 감소 연산자   --a   a의 값을 하나만 감소시킴(식 전체를 평가하면 감소 후의 값이 됨) */
