// 문제 4-5
// 정숫값을 읽어 들이고 1부터 시작해 그 값까지 카운트업하는 프로그램을 작성하자.

#include <stdio.h>

int main(void) {
	int no;

	printf("양의 정수를 입력하세요: ");
	scanf("%d", &no);

	if (no >= 1) {
		int i = 1;
		while (i <= no)
			printf("%d ", i++);
		printf("\n");
	}

	return 0;
}

/* 증가 연산자를 이용한 효과적인 표현
   카운트다운 프로그램과 가장 다른 점은 새롭게 변수 i를 사용한다는 점이다. i값은 1, 2, 3, ...처럼 늘어난다.
   루프 본체가 최초로 실행될 때는 i값인 1을 출력하고 그 직후에 인크리먼트를 수행해 i값을 2로 한다.
   (2번째는 변수 i의 값인 2를 출력한 다음 인크리먼트하여 3으로 한다.)
   no와 같은 값을 출력한 i값이 인크리먼트되어 no보다 1만큼 커진다.
   이로써 while문의 반복을 종료한다. */
