// 문제 1-5
// '경고!! 경고!!' 라고 출력하면서 경고음을 2회 울리는 프로그램을 작성하자

#include <stdio.h>

int main(void) {
	printf("경고!!\a경고!!\a\n");
	return 0;
}

// \a : 경고음을 나타내는 제어 문자
// 문자열 리터널(string literal): "ABC"와 "안녀앟세요."와 같이 일련의 문자를 큰따옴표로 감싼 것
/* + : 덧셈 기호, 양수 기호, 플러스, 더하기
 * - : 뺄셈 기호, 음수 기호, 마이너스, 빼기, 하이픈
 * * : 애스터리스크, 별 기호
 * / : 슬래시, 나누기
 * \ : 역슬래시, 백슬래시
 * % : 퍼센트
 * . : 마침표, 온점, 도트
 * , : 쉼표, 반점
 * : : 콜론, 쌍점
 * ; : 세미콜론, 쌍반점
 * ' : 작은따옴표, 싱글 쿼테이션
 * " : 큰따옴표, 더블 쿼테이션
 * ( : 여는 괄호
 * ) : 닫는 괄호
 * { : 여는 중괄호, 레프트 브레이스
 * } : 닫는 중괄호, 라이트 브레이스
 * [ : 여는 대괄호, 레프트 브래킷
 * ] : 닫는 대괄호, 라이트 브래킷
 * < : ~보다 작다, 레프트 앵글 브래킷
 * > : ~보다 크다, 라이트 앵글 브래킷
 * ? : 물음표
 * ! : 느낌표
 * & : 앰퍼샌드
 * ~ : 틸드
 * ^ : 캐럿
 * # : 샤프
 * _ : 믿줄, 언더라인
 * = : 등호, 이퀄
 * | : 버티컬 바, 파이프
 */
