// 문제 1-6
// int형 변수에 정숫값을 대입해 표시하는 프로그램과 int형 변수를 정숫값으로 초기화해 출력하는 프로그램을 작성하자.

#include <stdio.h>

int main(void) {
	int x;
	x = 15;
    // int x = 15;

	printf("x의 값은 %d입니다.\n", x);
	return 0;
}

// 상수(constant): 프로그램에서 미리 정해진 값
// 변수(variable): 자유롭게 값을 넣거나 읽을 수 있다.
/* 수치나 문자 등을 저장하는 '상자'라고 할 수 있는 변수를 사용하려면 자료형과 이름을 정확히 하기 위해
   사전에 선언(declaration)이 필요하다.
   ex) int x; */
// 대입: 기호 =는 '오른쪽 값을 왼쪽 변수에 대입하라.'는 지시다.
// 구문(statement): C언어에서는 세미콜론을 붙임으로써 올바른 구문이 된다.
/* 초기화(initialize): 변수를 생성할 때 임의의 값이나 쓰레기 값이 들어갈 수 있다.
                     그러므로 변수에 넣을 값을 미리 안다면 그 값을 처음부터 변수에 넣어두는 것 */
// 초기화 값(initializer): 변수 선언에서 = 기호 다음 부분은 변수 생성 시 넣을 값을 지정하는 것
